[{"data":1,"prerenderedAt":124},["ShallowReactive",2],{"team-members":3},[4,15,25,35,45,55,65,75,85,94,104,114],{"id":5,"image":6,"name":7,"title":8,"exp":9,"company":10,"description":11,"linkedin":12,"created_at":13,"updated_at":14},1,"storage/technologies/imad-jomaa.png","Imad Jomaa","CEO & Founder - Jgroup","20+","JGroup","Imad Jomaa, Founder and President of JGROUP sees that “Every brand has a story and it is our responsibility to provide them with the right tools, technology, and resources to communicate it in an impactful way.\r\nJGroup is actively involved in work across more than 90 countries, indicating its global reach and operations. It represents tech companies such as Snapchat, TikTok, Criteo, Foxpush, Blis, Amazon Ads and others across numerous countries, it holds a pivotal position in the industry landscape.\r\nIt stands as a dynamic and influential entity with a keen focus on emerging markets, delivering a comprehensive array of services to some of the world's most renowned brands. Our extensive offerings encompass media tv representation, outdoor advertising, cutting-edge technology solutions, leveraging big data and AI, as well as excellence in e-commerce, production, health, beauty, contracting and construction.\r\nJGroup operates in the GCC, the Middle East, Levant, North Africa, Europe, and the United States, continually expanding its reach and influence under Imad Jomaa's visionary leadership.","https://www.linkedin.com/in/imadjomaa1","2025-09-23T08:44:15.000000Z","2025-11-06T08:38:43.000000Z",{"id":16,"image":17,"name":18,"title":19,"exp":9,"company":20,"description":21,"linkedin":22,"created_at":23,"updated_at":24},2,"storage/technologies/patrick-haber.png","Patrick Haber","Vice President - Jgroup","Promomedia","Patrick Haber is the Managing Director of PromoMedia and Vice President of\u2028JGroup, Patrick has been a key figure in the industry since he began his\u2028career in 2004 with over 20 years of experience under his belt.\r\n\u2028A visionary leader with a keen eye for innovation, Patrick Haber has played\u2028a pivotal role in establishing PromoMedia as a top-tier supplier of\u2028billboards in the region. His strategic vision and leadership have been\u2028crucial in positioning the company as a leader in the market, with a strong\u2028reputation for providing high-quality advertising solutions.\u2028\r\n\u2028In addition to his role at PromoMedia, Patrick also holds the position of\u2028Vice President at JGroup, a prominent organization in the region\u2028specializing in technology, media, and advertising.","https://www.linkedin.com/in/patrick-haber-60901a43?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app","2025-09-23T20:08:04.000000Z","2025-11-06T08:38:34.000000Z",{"id":26,"image":27,"name":28,"title":29,"exp":9,"company":30,"description":31,"linkedin":32,"created_at":33,"updated_at":34},3,"storage/technologies/rabih-adnan.png","Rabieh Adnan","Managing Partner & CEO - Contour Media","Contour Media","Rabieh Adnan, Partner & CEO of Contour Media, Dubai, brings extensive experience in media strategy and brand communications. Under his leadership, Contour Media, a leading out-of-home media company, has driven growth and delivered innovative projects across the region. Rabieh is recognized for his strategic vision, strong leadership, and commitment to providing impactful media solutions for clients.","https://www.linkedin.com/in/rabieh-adnan-b9343622?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app","2025-10-13T12:04:06.000000Z","2025-11-06T08:42:00.000000Z",{"id":36,"image":37,"name":38,"title":39,"exp":9,"company":40,"description":41,"linkedin":42,"created_at":43,"updated_at":44},4,"storage/technologies/alain-david.png","Alain David","Chief Digital Officer - Jgroup","Promofix","Alain David is a distinguished leader in the digital media industry, currently serving as the Chief Digital Officer of JGroup and General Manager of Promofix, the digital media services division of JGroup Holding. JGroup is a globally recognized media conglomerate, and Alain has played a pivotal role in its growth and success since joining in 2014.\r\n\r\nWith a rich background in advertising, marketing, sales, and communications, Alain has consistently demonstrated his ability to elevate companies to global prominence. His expertise has positioned JGroup as one of the leading regional and global media powerhouses. In his current roles, Alain oversees JGroup’s digital investments, innovations, technologies, strategic partnerships, and operations across the Middle East and Africa","https://www.linkedin.com/in/alain-david-24383732","2025-09-23T20:15:17.000000Z","2025-11-06T08:39:06.000000Z",{"id":46,"image":47,"name":48,"title":49,"exp":9,"company":50,"description":51,"linkedin":52,"created_at":53,"updated_at":54},5,"storage/technologies/elias-wakim.png","Elias Wakim","Managing Director - Promofix GCC","promofix","Elias Wakim brings 25+ years of experience leading Promofix, WMS, and Optiview across the GCC. Throughout his career, he has demonstrated strategic foresight, effective leadership, and a strong ability to drive growth and deliver results. His extensive industry expertise and hands-on approach have been instrumental in expanding the companies’ presence and building trusted relationships with clients and partners across the region.","https://www.linkedin.com/in/eliewakim?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app","2025-10-13T10:30:46.000000Z","2025-11-10T11:40:29.000000Z",{"id":56,"image":57,"name":58,"title":59,"exp":9,"company":60,"description":61,"linkedin":62,"created_at":63,"updated_at":64},6,"storage/technologies/maroun-mousallem.png","Maroun Mousallem","Managing Director - AlMedia","Al Media","Maroun is a highly accomplished media executive with over 20 years of experience in the industry. He currently serves as the General Manager of AL Media Company, Al Jadeed TV, Waradana News and Hawacom TV Websites, overseeing its operations and growth. Under his leadership, AL Media Company has become a leading player in the region, with a vast portfolio of successful media ventures.\r\n\r\nWith his extensive knowledge and proven track record, Maroun Moussallem continues to make significant contributions to the media industry","https://www.linkedin.com/in/maroun-moussallem-0b103332","2025-09-23T20:16:58.000000Z","2025-11-06T08:39:55.000000Z",{"id":66,"image":67,"name":68,"title":69,"exp":9,"company":70,"description":71,"linkedin":72,"created_at":73,"updated_at":74},9,"storage/technologies/ahmed-elsayed.png","Ahmed Elsayed","Managing Partner & CEO - FoxPush","FoxPush","Ahmed Elsayed, Chief Executive Officer and Co-Founder of FoxPush, leads a dedicated team that is revolutionizing the Ad-Tech ecosystem. With a deep understanding of the unique challenges faced by Arabic-speaking audiences, we identified significant gaps in existing Ad-Tech solutions and embarked on a mission to create innovative technologies that address these specific needs.\r\n\r\nUnder Ahmed’s leadership, FoxPush has developed a suite of advanced tools designed to optimize digital advertising and enhance user engagement in the MENA region. Our state-of-the-art solutions leverage cutting-edge technology to ensure precise targeting, effective communication, and a seamless user experience.","https://www.linkedin.com/in/smartcode","2025-09-23T20:31:46.000000Z","2025-11-06T08:40:31.000000Z",{"id":76,"image":77,"name":78,"title":79,"exp":9,"company":80,"description":81,"linkedin":82,"created_at":83,"updated_at":84},14,"storage/technologies/raffoul-matar.png","Raffoul Matar","Managing Director - TheMediaConnector","The Media Connector","With over 25 years of experience in the Media & Marketing industry across the Levant and GCC markets, Raffoul brings a wealth of expertise to The Media Connector. Holding a degree in Business Marketing and Management from the Lebanese American University, Raffoul has held pivotal roles in several top media and advertising agencies throughout his career.\r\n\r\nRaffoul began his journey at Initiative Media in Beirut, where he perfected his skills working across diverse industry sectors. His career then led him to Mediacom in Beirut, where he served as Media Director, overseeing the Media buying unit for Grey Worldwide in Levant, Libya, and Egypt.\r\n\r\nIn 2006, Raffoul transitioned to Dubai, assuming the role of Head of Buying at PHD. Following this, he joined Tree Ad International as Regional Commercial Director, where he played a key role in launching Creative Outdoor Solutions, an innovative taxi advertising medium in Abu Dhabi.","https://www.linkedin.com/in/raffoulmattar/","2025-09-23T20:32:52.000000Z","2025-11-06T08:40:46.000000Z",{"id":86,"image":87,"name":88,"title":89,"exp":9,"company":90,"description":91,"linkedin":12,"created_at":92,"updated_at":93},18,"storage/technologies/rif-naffaa.png","Rif Naffaa","General Manager - Assada production","Assada Production","Rif Naffaa is a seasoned professional with over 15 years of experience in the content and production industries.\r\n\r\nRif is currently the General Manager of Assada Productions, and she has played an important role in determining the company's vision as a prominent production house.\r\n\r\nRif's leadership has driven Assada Productions to the forefront of digital content creation and commercial production, specializing in the production, development, and\r\n\r\ndistribution of a varied slate of digital shows, dramas, and platforms series.","2025-09-23T11:23:23.000000Z","2025-11-06T10:05:17.000000Z",{"id":95,"image":96,"name":97,"title":98,"exp":99,"company":98,"description":100,"linkedin":101,"created_at":102,"updated_at":103},20,"storage/technologies/maya-elmouhaier.jpg","Maya El Mouhaier","Chief Marketing Officer – JGroup","15+","A visionary marketing leader driving JGroup’s brand strategy and global partnerships across 35+ markets, with a proven track record in digital transformation, media innovation, and ecosystem growth.","https://www.linkedin.com/in/maya-el-mouhaier-1485912","2025-09-23T20:33:43.000000Z","2025-10-30T10:51:46.000000Z",{"id":105,"image":106,"name":107,"title":108,"exp":99,"company":109,"description":110,"linkedin":111,"created_at":112,"updated_at":113},21,"storage/technologies/rafat-jebril.png","Rafat Jebril","Managing Partner & CEO - Digimotive","Digi Motive","Rafat Jebril is the founder and Managing Partner of Digimotive Technology FZCO. Under his leadership, Digimotive has become a notable player in the digital media landscape, providing innovative solutions tailored to the Middle East and North Africa (MENA) region. The company, founded in 2017, focuses on enhancing the digital ecosystem by offering structured, full-funnel solutions aimed at optimizing digital marketing and technology services. Rafat Jebril's strategic vision and leadership have been instrumental in positioning Digimotive as a key player in the industry.","https://www.linkedin.com/in/rafatjebril","2025-09-23T20:29:44.000000Z","2025-11-06T08:41:27.000000Z",{"id":115,"image":116,"name":117,"title":118,"exp":119,"company":120,"description":121,"linkedin":122,"created_at":123,"updated_at":123},23,"storage/technologies/Ibrahim-Sabbagh.jpg","Ibrahim El Sabbagh","Managing Director & Sales - Jgroup","szhsys","Jgroup","Ibrahim El Sabbagh, Managing Director & Sales at JGroup Holding, has been with JGroup UAE since its inception in Dubai. He leads commercial operations for Global World Media Services & Promofix across the UAE and KSA, driving strategic sales growth and client engagement. With over a decade of experience in media & advertising, he specializes in data-driven strategy, leadership & business development. Previously, he led Advertising Sales at Thomson Reuters expanding its regional presence across MENA.","https://www.linkedin.com/in/ibzsabbagh?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app","2025-11-06T09:13:41.000000Z",1762949461692]